IDENTIFICATION DIVISION.
PROGRAM-ID. XMASTREE.
AUTHOR SATISH.

DATA DIVISION. 
WORKING-STORAGE SECTION.
01 WS-OUT     PIC X(80) VALUE SPACES.
01 WS-N       PIC 9(2)  VALUE 0. 
01 WS-CENTER  PIC 9(2)  VALUE 40. 

PROCEDURE DIVISION.

MOVE '|'   TO WS-OUT(WS-CENTER:1).
DISPLAY WS-OUT.
MOVE '\|/' TO WS-OUT(39:3).
DISPLAY WS-OUT.

PERFORM VARYING WS-N FROM 1 BY 2 UNTIL WS-N > 20
INITIALIZE WS-OUT
MOVE ALL '*' TO WS-OUT(WS-CENTER:WS-N)

IF WS-N = 1 THEN
MOVE '--' TO WS-OUT(38:2)
MOVE '--' TO WS-OUT(41:2)
END-IF

COMPUTE WS-CENTER = WS-CENTER - 1
DISPLAY WS-OUT
END-PERFORM. 

INITIALIZE WS-OUT.
MOVE '_ __| |__ _' TO WS-OUT(35:11).
DISPLAY WS-OUT.
INITIALIZE WS-OUT.
DISPLAY WS-OUT.
MOVE 'MERRY CHRISTMAS' TO WS-OUT(33:15).
DISPLAY WS-OUT.
STOPRUN.
